app/views/events/destroy.js.erb


<% if !Event.exists? %>
---
SELECT 1 AS one FROM "events" LIMIT 1