app/views/events/index.html.erb

SELECT "updates".* FROM "updates" ORDER BY created_at DESC LIMIT 12
---
            <ul>
                <% Update.limit(12).order("created_at DESC").each do |update| %>