app/views/events/post_comment.js.erb

$("#discussionBoard-comments ul").prepend('<li><span class = "comment_timestamp"><%= @comment.username %> (<%= time_ago_in_words(@comment.created_at) %> ago):</span> <%= @content %></li>');
---
INSERT INTO "comments" ("content", "created_at", "event_id", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["content", "fg"], ["created_at", Mon, 01 Jul 2013 18:46:05 PDT -07:00], ["event_id", 435], ["updated_at", Mon, 01 Jul 2013 18:46:05 PDT -07:00], ["username", "Spaiderman"]]