app/views/events/show.html.erb

					<ul>
						<% @event.comments.order("created_at DESC").each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = 437 ORDER BY created_at DESC

											<div class = "voteIcon">
												<% if venue.voters.where(:user_id => current_user.id).exists? %>
---
SELECT "voters".* FROM "voters" WHERE "voters"."venue_id" = 296
SELECT 1 AS one FROM "voters" WHERE "voters"."venue_id" = 296 AND "voters"."user_id" = 8 LIMIT 1

									<% if @show_votecounts %>
										<div class = "voteCount" data-votecount = <%= "#{venue.voters.count}" %>><%=venue.voters.count %></div>
---
SELECT COUNT(*) FROM "voters" WHERE "voters"."venue_id" = 296

<%= javascript_tag do %>
	$(function() {
		//sort venues by votes
		voteSort();

		//votemeter functionality
  		<% @event.venues.each do |venue| %>
  			calculateVoteMeter('<%= venue.id %>', '<%= venue.voters.count%>', '<%= @total_votecounts%>' )
  		<% end %>

		//createCountdowns for event#show
  		createCountdown("<%= (@event.event_start - @event.vote_end.hours).to_s %>", "#voteCountdown");
  		//createCountdown("<%= @vote_date.to_s %>", "#venueSuggestCountdown");

  		<% if @event.stage != "Voting" %>
  			$('#venueList ul li.listItem').first().css('border', 'solid 3px red');
  			$('#venueList ul li .voteCount').first().css('color', 'red');
  			$('.listItem:first .venueStickyHeader').append('- WINNER!');
  			$('.listItem:first .venueStickyHeader').css('color', 'red');
  			$('.listItem:first .voteCount').css('color', 'red');
  		<% end %>

---
SELECT "venues".* FROM "venues" WHERE "venues"."event_id" = 437
SELECT COUNT(*) FROM "venues" WHERE "venues"."event_id" = 437