app/views/pages/archived.html.erb

                                <td><%= event.owner.to_s %></td>
                                <td><%= (event.winner == nil ? "No Venues Suggested" : Venue.find(event.winner).name) %></td>
---
SELECT "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT 1  [["id", 296]]