app/views/venues/increment_vote.js.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
---
		$oList = $previousListItem.siblings("ol.voteList");
		$oList.find("li:contains(<%= escape_javascript(current_user.username) %>)").remove();

SELECT COUNT(*) FROM "voters" WHERE "voters"."venue_id" = 298
---
<% @event.venues.each do |venue| %>
	calculateVoteMeter('<%= venue.id %>', '<%= venue.voters.count%>', '<%= @total_votecounts%>' )