app/controllers/events_controller.rb

  def show
    @venues = @event.venues.includes(:voters).order("votecount DESC, created_at ASC")

    #update :votecount attribute in venues
    @venues.each do |venue|
---
SELECT COUNT(*) FROM "venues" WHERE "venues"."event_id" = 437
SELECT COUNT(*) FROM "voters" WHERE "voters"."venue_id" = 296
SELECT "venues".* FROM "venues" WHERE "venues"."event_id" = 437
SELECT "voters".* FROM "voters" WHERE "voters"."venue_id" = 296