app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."stage" = 'Voting' ORDER BY event_start ASC
SELECT COUNT(*) FROM "events" WHERE "events"."stage" = 'Finished'
---
  def index

      @name_entered = (current_user.firstname.nil? or current_user.lastname.nil?)

      #only show events that user is a guest of
      @events = current_user.events.where(:stage => "Voting").order("event_start ASC")
      @upcoming_events = current_user.events.where(:stage => "Finished").order("event_start ASC")
      gon.numUpcoming = @upcoming_events.count

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "437"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
---
  def show
    @event = Event.find(params[:id])

    #if Guest.where(:user_id => current_user.id, :event_id => @event.id).first.nil?
    if !current_user.invited?(@event)
       redirect_to events_path, notice: 'You are not authorized to access that page.'
    else
      @owner = @event.owner
      @guests = @event.users.map { |u| u.username }

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "435"]]
---
  def edit
    @event = Event.find(params[:id])

INSERT INTO "events" ("archive_job_id", "created_at", "event_email_job_id", "event_start", "name", "notes", "stage", "updated_at", "user_id", "vote_end", "voting_email_job_id", "winner") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "updates" ("content", "created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(params[:event])

    #save event owner as current_user
    @event.owner_id = current_user.id

    #add current_user to guests of this event
    @event.users << current_user

      respond_to do |format|
        if @event.save
          #flash[:alert] = "#{@event.event_start}"
          AutoMailer.event_create_email(@event.id).deliver
          write_jobs(@event.id)
          @update = Update.create!(:content => "#{current_user} just created a new event: \"#{@event}\"", :event_id => @event.id)

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "439"]]
UPDATE "events" SET "event_start" = '2013-07-26 02:45:00.000000', "updated_at" = '2013-07-10 05:34:10.542013' WHERE "events"."id" = 454
INSERT INTO "updates" ("content", "created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "Spaiderman just updated \"tshi\""], ["created_at", Tue, 02 Jul 2013 20:11:08 PDT -07:00], ["event_id", nil], ["updated_at", Tue, 02 Jul 2013 20:11:08 PDT -07:00], ["user_id", nil]]
INSERT INTO "comments" ("content", "created_at", "event_id", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["content", "Spaiderman just updated the event"], ["created_at", Tue, 09 Jul 2013 22:34:10 PDT -07:00], ["event_id", 454], ["updated_at", Tue, 09 Jul 2013 22:34:10 PDT -07:00], ["username", nil]]
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
        @content = "#{current_user} updated the event"
        @update = Update.create!(:content => "#{current_user} just updated \"#{@event}\"", :event_id => @event.id)
        @comment = Comment.create!(:content => @content, :event_id => @event.id)

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "438"]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 438]]
INSERT INTO "updates" ("content", "created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def destroy
    @event = Event.find(params[:id])
    destroy_jobs(@event.id)
    @event.destroy
    @update = Update.create!(:content => "#{current_user} just deleted \"#{@event}\"", :event_id => @event.id)

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "439"]]
---
  def send_reminder
    @event = Event.find(params[:event_id])

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "435"]]
INSERT INTO "comments" ("content", "created_at", "event_id", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["content", "fg"], ["created_at", Mon, 01 Jul 2013 18:46:05 PDT -07:00], ["event_id", 435], ["updated_at", Mon, 01 Jul 2013 18:46:05 PDT -07:00], ["username", "Spaiderman"]]
INSERT INTO "updates" ("content", "created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def post_comment
    @event = Event.find(params[:event_id])
    @content = params[:comment]

    @comment = Comment.create!(:content => @content, :event_id => params[:event_id], :username => current_user.username)
    Update.create!(:content => "#{current_user} just posted a comment on \"#{@event.name}\"", :event_id => @event.id)