app/controllers/pages_controller.rb

SELECT "events".* FROM "events" WHERE "events"."stage" = 'Archived' ORDER BY event_start DESC LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM "events" WHERE "events"."stage" = 'Archived'
---
  def archived
  	@events = current_user.events.stage_archived.paginate(:page => params[:page], :per_page => 12)