app/controllers/venues_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "437"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
SELECT 1 AS one FROM "venues" WHERE "venues"."user_id" = 8 AND "venues"."event_id" = 437 LIMIT 1
---
  def new
    @event_id = params[:event_id]
    @event_user = Event.find(@event_id).user
    @already_suggested_venue = Venue.exists?(:user_id => current_user.id, :event_id => @event_id)

INSERT INTO "venues" ("address", "comments", "created_at", "event_id", "name", "updated_at", "url", "user_id", "votecount") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "events".* FROM "events" WHERE "events"."id" = 437 LIMIT 1
SELECT 1 AS one FROM "voters" WHERE "voters"."user_id" = 8 AND "voters"."event_id" = 437 LIMIT 1
INSERT INTO "voters" ("created_at", "event_id", "updated_at", "user_id", "venue_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 30 Jun 2013 22:57:28 PDT -07:00], ["event_id", 437], ["updated_at", Sun, 30 Jun 2013 22:57:28 PDT -07:00], ["user_id", 8], ["venue_id", 296]]
INSERT INTO "updates" ("content", "created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
INSERT INTO "comments" ("content", "created_at", "event_id", "updated_at", "username") VALUES (?, ?, ?, ?, ?)
---
  def create
    @venue = Venue.new(params[:venue])
    @venue.address = @venue.address.gsub("\n", "<br>").html_safe

    if(@venue.event != nil)
      @venue.user = current_user
      #@venue.votecount = 1

      respond_to do |format|
        if @venue.save
          #automatically votes for suggested venue if not already voted for this event
          if !Voter.exists?(:user_id => current_user.id, :event_id => @venue.event.id)
            Voter.create!(:user_id => current_user.id, :event_id => @venue.event.id, :venue_id => @venue.id)
            @venue.update_column(:votecount, 1)
          end

          @content = "#{current_user} just suggested a venue"
          @update = Update.create!(:content => "#{current_user} just suggested a venue for \"#{@venue.event}\"")
          @comment = Comment.create!(:content => @content, :event_id => @venue.event.id)

DELETE FROM "voters" WHERE "voters"."id" = ?  [["id", 762]]
UPDATE "venues" SET "address" = ' this<script>alert("poop");</script>', "votecount" = 0, "updated_at" = '2013-07-03 02:46:54.852196' WHERE "venues"."id" = 306
SELECT "events".* FROM "events" WHERE "events"."id" = 435 LIMIT 1
SELECT "voters".* FROM "voters" WHERE "voters"."venue_id" = 297
SELECT 1 AS one FROM "voters" WHERE "voters"."user_id" = 8 AND "voters"."event_id" IS NULL LIMIT 1
INSERT INTO "updates" ("content", "created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
INSERT INTO "voters" ("created_at", "event_id", "updated_at", "user_id", "venue_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 01 Jul 2013 17:29:07 PDT -07:00], ["event_id", 435], ["updated_at", Mon, 01 Jul 2013 17:29:07 PDT -07:00], ["user_id", 8], ["venue_id", 297]]
INSERT INTO "comments" ("content", "created_at", "event_id", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["content", "Spaiderman just modified a venue"], ["created_at", Tue, 09 Jul 2013 22:33:46 PDT -07:00], ["event_id", 454], ["updated_at", Tue, 09 Jul 2013 22:33:46 PDT -07:00], ["username", nil]]
---
  def update
    @venue.assign_attributes(params[:venue])
    @venue_changed = @venue.changed? #checks is the venue was actually modified or not

    if(@venue_changed)
        #reset votecount for venue if it is modified
        @venue.assign_attributes(:votecount => 0)

        #remove voting records for venue if it is modified
        Voter.destroy_all(:venue_id => @venue.id)
        @venue.update_column(:votecount, 0)

        #checks if user voted for another venue, if not vote for this one
        if !Voter.exists?(:user_id => current_user.id, :event_id => @venue.event.id)
            Voter.create!(:user_id => current_user.id, :event_id => @venue.event.id, :venue_id => @venue.id)
        end

        @content = "#{current_user} modified a venue"
        @update = Update.create!(:content => "#{current_user} just modified a venue for \"#{@venue.event}\"")
        @comment = Comment.create!(:content => @content, :event_id => @venue.event.id)

SELECT "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT 1  [["id", "297"]]
INSERT INTO "updates" ("content", "created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
INSERT INTO "comments" ("content", "created_at", "event_id", "updated_at", "username") VALUES (?, ?, ?, ?, ?)
DELETE FROM "venues" WHERE "venues"."id" = ?  [["id", 297]]
---
  def destroy
    @venue = Venue.find(params[:id])

    @content = "#{current_user} deleted a venue"
    @update = Update.create!(:content => "#{current_user} just deleted a venue for \"#{@venue.event}\"")
    @comment = Comment.create!(:content => @content, :event_id => @venue.event.id)


    respond_to do |format|
      format.html { redirect_to @venue.event, notice: "You have successfully removed your suggested venue" }
      format.js
      format.json { head :no_content }
    end
      @venue.destroy

SELECT "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT 1  [["id", "311"]]
SELECT 1 AS one FROM "voters" WHERE "voters"."user_id" = 8 AND "voters"."venue_id" = 311 LIMIT 1
SELECT "voters".* FROM "voters" WHERE "voters"."user_id" = 8 AND "voters"."event_id" = 435 LIMIT 1
DELETE FROM "voters" WHERE "voters"."id" = ?  [["id", 765]]
SELECT COUNT(*) FROM "voters" WHERE "voters"."venue_id" = 298
---
  def increment_vote

    if !user_signed_in?
      #redirect_to @venue.event, notice: "You must be signed in to vote."
    else

       @venue = Venue.find(params[:venue_id])
       @event = @venue.event
       @already_voted = Voter.exists?(:user_id => current_user.id, :venue_id => params[:venue_id ])
       @show_votecounts = (current_user.id == @event.user_id or current_user.username == "Spaiderman")

      #user has already voted for this venue
      if (@already_voted)
         respond_to do |format|
           format.html {redirect_to @event, notice: "You have already voted for this venue"}
           format.js {render :js => %($("#notice").text("You have already voted for this venue");)}
         end
      else
        @notice_text = "Your vote has been recorded."
        #if user already voted for this event, remove previouv vote associate
        @voter = Voter.where(:user_id => current_user.id, :event_id => params[:event_id]).first
        if !@voter.nil?
          @previous_venue = Venue.find(@voter.venue_id)
          @voter.destroy
          @previous_votecount = @previous_venue.voters.count

INSERT INTO "voters" ("created_at", "event_id", "updated_at", "user_id", "venue_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 02 Jul 2013 20:07:40 PDT -07:00], ["event_id", 435], ["updated_at", Tue, 02 Jul 2013 20:07:40 PDT -07:00], ["user_id", 8], ["venue_id", 311]]
SELECT COUNT(*) FROM "updates"
INSERT INTO "updates" ("content", "created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
INSERT INTO "comments" ("content", "created_at", "event_id", "updated_at", "username") VALUES (?, ?, ?, ?, ?)
---
        #num = @venue.votecount + 1
        #@venue.update_attributes(:votecount => num )

        Voter.create!(:user_id => current_user.id, :event_id => @venue.event.id, :venue_id => @venue.id)
        @venue.update_column(:votecount, @venue.voters.count + 1)

        @update = Update.create!(:content => @content + " for the event: \"#{@venue.event}\"")
        @comment = Comment.create!(:content => @content, :event_id => @venue.event.id)