app/controllers/venues_controller.rb

  def edit
    @venue = Venue.find(params[:id])
---
SELECT "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT 1  [["id", "297"]]

  def update
    @venue = Venue.find(params[:id])
---
SELECT "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT 1  [["id", "297"]]